# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
df1=pd.Series(np.random.randint(1,4,100).T)
df2=pd.Series(np.random.randint(1,3,100).T)
df3=pd.Series(np.random.randint(10000,30000,100).T)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
data=pd.concat([df1,df2,df3],axis=1)

In [4]:
data

    0  1      2
0   3  1  21466
1   1  2  15257
2   2  2  23900
3   1  2  10147
4   2  1  21778
.. .. ..    ...
95  2  2  17577
96  1  1  14397
97  3  2  20562
98  3  2  17634
99  3  1  13603

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
data=data.rename(columns={0:"bedrs",1:"bathrs",2:"price_sqr_meter"},inplace=True)
data

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
bigcolumn=pd.concat([df1,df2,df3],axis=0)

In [7]:
bigcolumn

0         3
1         1
2         2
3         1
4         2
      ...
95    17577
96    14397
97    20562
98    17634
99    13603
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
# No index values is from 0 to 99 and it repeats. the length of the bigcolumn is 300 
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [9]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

0          3
1          1
2          2
3          1
4          2
       ...
295    17577
296    14397
297    20562
298    17634
299    13603
Length: 300, dtype: int32